صادرات const FA = {
  ترجمه: {
    FA: 'فارسی',
    en: 'انگلیسی',
    zh: '简体中文'،
    ja: '日本語'،
    ko: '한국어'،
    fr: 'Français',
    es: "اسپانول"،
    pt: "پرتغال"،
    ترجیح: "ترجیح"،
    disable_button_vibration: "غیرفعال کردن دکمه لرزش "،
    برگشت: "بازگشت"،
    زبان: "زبان"،
    app_theme: "تم برنامه"،
    سیستم: "سیستم"،
    تاریک: "تاریک"،
    روشن: "روشن"،
    تنظیمات: "تنظیمات"،
    backup_and_security: 'پشتیبان گیری و امنیت'،
    manager_wallet: "مدیریت کیف پول"،
    نمایه: 'نمایه'،
    app_preferences: "تنظیمات برنامه"،
    اطلاعیه ها: "اعلانها"،
    help_support: 'Help & Support',
    about_my_doge: 'درباره دوج من'،
    مدیر: "مدیر"،
    i_cloud: 'iCloud',
    ابر: «ابر»،
    youve_backed_up_to: 'شما نسخه پشتیبان تهیه کردید',
    you_havent_created_a_cloud_backup: 'شما یک نسخه پشتیبان ابری ایجاد نکرده اید'،
    مدیریت: "مدیریت"،
    پشتیبان گیری: 'پشتیبان گیری'،
    view_seed_phrase: 'مشاهده عبارت Seed',
    پین: 'PIN',
    back_up_to: 'پشتیبان گیری به'،
    back_up_your_wallet: 'پشتیبان گیری از کیف پول خود'،
    back_up_your_wallet_description:
      کیف پول خود را در فضای ابری ذخیره کنید و از آن با رمز عبور محافظت کنید.  همچنین می‌توانید عبارت Seed خود را یادداشت کنید یا آن را در یک مدیر رمز عبور کپی کنید.',
    pin_description:
      "اگر پین خود را فراموش کرده اید، باید کیف پول خود را از یک نسخه پشتیبان بازیابی کنید."،
    change_pin: "تغییر پین"،
    your_pin_is_required:
      "پین شما برای پرداخت و انجام اقدامات حساس مورد نیاز است."،
    use_fingerprint: «استفاده از شناسه اثر انگشت/ چهره»،
    ask_every_time_i_open_the_app: 'هر بار که برنامه را باز می کنم سؤال کنید'،
    this_will_remove_all_wallet:
      "با این کار تمام داده های مربوط به کیف پول از دستگاه شما حذف می شود."،
    delete_wallet: 'حذف کیف پول'،
    sign_in_to_the_dogeverse: "ورود به Dogeverse"،
    dogeverse_intro_description:
      "DogeTag خود را ادعا کنید، دوستان خود را پیدا کنید، با پیوند خود پرداخت ها را دریافت کنید و با محتوای Dogeverse تعامل داشته باشید."،
    sign_in: "ورود به سیستم"،
    sign_in_description:
      "شماره تلفن شما فقط برای ورود به سیستم استفاده می شود و عمومی نخواهد شد."،
    create_account_description:
      "به Dogeverse بپیوندید و با شبکه عظیمی از Shibes ارتباط برقرار کنید."،
    send_verification: «ارسال تأیید»،
    verify_your_phone_number: 'شماره تلفن خود را تأیید کنید'،
    enter_the_code_sent_to: 'کد ارسال شده به را وارد کنید',
    resend_code: "ارسال مجدد کد"،
    wrong_number: 'عدد اشتباه'،
    confirm_code: "تأیید کد"،
    youve_ented_the_verse: 'شما وارد آیه شدید',
    youe_now_ready_to_explore_the_dogeverse:
      "شما اکنون آماده کاوش در Dogeverse هستید!"،
    lets_go: 'بزن بریم!'،
    edit_profile: 'ویرایش نمایه'،
    social_connect: «اجتماعی اتصال»،
    profile_privacy: 'حریم خصوصی'،
    profile_is_public: 'نمایه عمومی است'،
    show_wallet_address_and_tip_button: "نمایش آدرس کیف پول و دکمه پاداش"،
    ترجیحات: "ترجیحات"،
    confirm_x_tips: 'پاداش 𝕏 تایید'،
    tips_received: 'پاداش دریافت شده',
    new_followers: 'فالوورهای جدید',
    new_memes: "مم های جدید"،
    about_mydoge: 'درباره MyDoge'،
    Terms_of_use: "شرایط استفاده"،
    privacy_policy: 'خط مشی رازداری'،
    share_mydoge: 'Share MyDoge'،
    visit_our_website: 'از وب سایت ما بازدید کنید',
    settings_and_support: 'تنظیمات و پشتیبانی'،
    connect_twitch: 'اتصال بهTwitch'،
    connect_x: 'اتصال به𝕏'،
    create_a_post: 'ایجاد یک پست'،
    زیر: "دنبال کردن"،
    پیروان: "فالوورها"،
    Recent_activity: "فعالیت اخیر"،
    تاریخ: «تاریخ»،
    قیمت: 'قیمت'،
    USD: 'USD',
    txs: "TXs"،
    hr: 'ساعت'،
    ارسال: "ارسال"،
    دریافت: «دریافت»،
    خرید خرید'،
    اسکن: "اسکن"،
    از: 'از'،
    به: 'به'،
    توجه: "توجه"،
    مهر زمان: "مهر زمانی"،
    تاییدیه ها: "تأییدات"،
    tx_hash: 'TX Hash',
    tx_hash_copied: 'هش تراکنش کپی شد'،
    note_copied: 'یادداشت کپی شده'،
    address_copied: 'آدرس کپی شد',
    کیف پول: "کیف پول"،
    دوجورس: «دوجورس»،
    فروشگاه: "فروشگاه"،
    receive_doge: 'دریافت Doge',
    send_doge: 'ارسال Doge',

confirm_transaction: "تأیید تراکنش"،
    scan_qr_code: 'اسکن کد QR'،
    new_post: "پست جدید"،
    send_doge_a

er: "روی کاغذ بنویس"،
    write_down_seed_phrase:
      عبارت Seed خود را یادداشت کنید یا آن را در مدیر رمز عبور ذخیره کنید.
    Why_backups_important_description:
      'حضور شخصی به این معنی است که هیچ کس دیگری نمی تواند به وجوه شما دسترسی داشته باشد، حتی تیم MyDoge.  در صورتی که دستگاه شما آسیب ببیند، گم شود یا دزدیده شود یا پاک شود، یک نسخه پشتیبان تنها راه بازیابی کیف پول شما است.',
    select_password: "یک رمز عبور انتخاب کنید"،
    use_memorable_password:
    ، هستند تر امن تر طولانی های گذرواژه . بسپارید  خاطر به بتوانید که کنید استفاده عبوری رمز از لطفا   .'،
    more_secure_password:
    . هستند تر امن تر طولانی های گذرواژه . بسپارید  خاطر به بتوانید که کنید استفاده عبوری رمز از لطفا   .'،
    lost_password_lose_backup:
      "اگر این رمز عبور را گم کنید، پشتیبان کیف پول خود را از دست خواهید داد."،
    رمز عبور: "رمز عبور"،
    confirm_password: "تأیید رمز عبور"،
    confirm_backup: "تأیید پشتیبان گیری"،
    overwrite_backup_title: 'بازنویسی نسخه پشتیبان موجود؟'،
    exist_wallet_overwrite_prompt:
    '؟کنید بازنویسی را آن خواهید می آیا. است شده گرفته پشتیبان ابری فضای  در قبلاً که دارید موجود پول کیف یک شما .'،
    overwrite_backup: 'بازنویسی نسخه پشتیبان'،
    import_existing_wallet: "وارد کردن کیف پول موجود"،
    known_cloud_error: 'خطاي ناشناخته ابر'،
    known_cloud_error_body:
      "هنگام پشتیبان‌گیری در فضای ابری، خطای ناشناخته‌ای روی داد."،
    try_again_or_notify_support: "لطفا دوباره امتحان کنید یا به پشتیبانی MyDoge اطلاع دهید."،
    enter_recovery_password: 'رمز عبور بازیابی را وارد کنید'،
    enter_cloud_password_description:
      «گذرواژه‌ای را که برای ذخیره عبارت اولیه خود در فضای ابری استفاده کرده‌اید، وارد کنید».
    import_wallet: "وارد کردن کیف پول"،
    imported_wallet_title: "شما کیف پول خود را وارد کرده اید"،
    imported_wallet_success: "شما با موفقیت کیف پول خود را وارد کردید!"،
    safe_new_wallet: 'کیف پول جدید خود را ایمن کنید'،
    set_pin: 'تنظیم یک پین 6 رقمی'،
    reenter_pin: 'PIN_LENGTH 6 رقمی را دوباره وارد کنید'،
    pin_payment_note: "برای ارسال پرداخت ها به پین خود نیاز دارید"
    use_biometric: «استفاده از شناسه اثر انگشت/ چهره»،
    ask_every_time: 'هر بار که برنامه را باز می کنم سؤال کنید'،
    create_pin: "ایجاد پین"،
    confirm_pin: "تأیید پین"،
    select_dogeverse_username: 'انتخاب یک DogeTag'،
    dogeverse_link: "لینک وب شما خواهد بود"،
    ادامه دهید: 'ادامه'،
    dogeverse_entry_title: 'شما آیه را وارد کردید'،
    dogeverse_entry_body: "شما اکنون آماده کاوش در Dogeverse هستید!"،
    manual_backup_title: "عبارت اولیه را بنویسید"،
    save_words_order:
      این کلمات را به ترتیب ذخیره کنید.  آنها را یادداشت کنید و در جایی امن نگه دارید، یا آنها را در یک مدیر رمز عبور کپی کنید.'،
    seed_phrase_key:
      عبارت Seed شما کلید کیف پول شماست.  هر کسی که این عبارت را داشته باشد می تواند به وجوه شما دسترسی داشته باشد.  برای کسب اطلاعات بیشتر ضربه بزنید',
    write_down: 'من آن را یادداشت کردم',
    اسکرین شات_هشدار:
      ممکن است اسکرین‌شات‌ها یا سایر کپی‌های دیجیتالی عبارت Seed شما به شخص ثالث درز کند.
    seed_phrase_access:
      هر کسی که عبارت Seed شما را داشته باشد می تواند به وجوه شما دسترسی داشته باشد.  عبارت Seed خود را با کسی به اشتراک نگذارید.  MyDoge عبارت Seed را برای شما ذخیره نمی کند.  اگر دستگاه شما آسیب ببیند، گم شود یا دزدیده شود، یا غیر قابل دسترس باشد، عبارت Seed شما تنها راه بازیابی کیف پول شما است.'،
    icloud_backup: 'iCloud Backup'،
    cloud_backup: 'پشتیبان گیری ابری'،
    dont_lose_wallet: "کیف پول خود را گم نکنید!"،
    save_online_backup: "ذخیره یک نسخه پشتیبان آنلاین در"،
    icloud: 'iCloud',
    google_drive: «Google Drive»،
    do_this_later: 'من بعداً این کار را انجام خواهم داد'،
    confirm_seed_phrase: 'تأیید عبارت seed',
    select_correct_word:
      "لطفا کلمه صحیح را در هر موقعیت از لیست زیر انتخاب کنید."،
    enter_seed_phrase: 'عبارت دانه را وارد کنید'،
    enter_seed_phrase_instructions:
      برای بازیابی کیف پول موجود خود عبارت ۱۲ کلمه ای خود را وارد کنید.
    خمیر: «رب»،
    restore_wallet: 'بازیابی کیف پول'،
    wallet_imported: 'کیف پول وارد شد!'،
    wallet_

imported_body: 'کیف پول شما آماده استفاده است.'،
    restore_existing_wallet: 'کیف پول موجود خود را بازیابی کنید'،
    restore_existing_wallet_instructions:
      پس شما قبلا یک کیف پول دارید؟  پس بیایید آن را برگردانیم!'،
    restore_from: 'بازیابی از'،
    restore_from_cloud_description: 'کیف پول خود را از کیف پول خود بازیابی کنید'،
    restore_w

مسعود احمدی: ith_seed_phrase: 'بازیابی با عبارت seed',
    restore_with_seed_phrase_description:
      از عبارت seed خود برای بازیابی کیف پول MyDoge موجود استفاده کنید.
    no_cloud_backup: 'بدون پشتیبان گیری ابری'،
    no_cloud_backup_body:
      پشتیبان ابری یافت نشد.  لطفاً از یک عبارت اولیه بازیابی کنید، یا یک کیف پول جدید ایجاد کنید.
    create_wallet: 'ایجاد کیف پول'،
    now_have_wallet: 'من قبلا یک کیف پول دارم',
    buy_send_receive_dogecoin: "خرید، ارسال و دریافت Dogecoin"،
    send_doge_tips:
      'نکات دوج را در مورد 𝕏 ارسال کنید، دوج خود را ایمن ذخیره کنید و بانک خود باشید'،
    shop_gift_cards_apparel: 'خرید کارت هدیه و پوشاک'،
    خرید_کارت_هدیه:
      "کارت های هدیه را با Dogecoin بخرید، یا از آخرین مد دوج بخرید".
    enter_the_dogeverse: "ورود به Dogeverse"،
    pretend_dogtag:
      'DogeTag خود را مطالبه کنید، دوستان خود را پیدا کنید، با پیوند خود پرداخت ها را دریافت کنید و میم ها را به اشتراک بگذارید.
    so_much_tip: "خیلی نکته، خیلی عجب!"،
    موفقیت: "موفقیت"،
    sent_doge: 'تو فرستادی'،
    some_doge: 'بعضی دوج!',
    مجموع: "کل"،
    انجام شد: "انجام شد"،
    shop_with_doge: "خرید با دوج"،
    اوه: "اوه!"،
    no_comments_yet: 'هنوز نظری وجود ندارد',
    to_post_a_comment: 'برای ارسال نظر',
    your_comment: 'نظر شما',
    پست: "پست"،
    حذف: "حذف"،
    enable_push_notifications: «اعلان‌های فشاری فعال شود؟»،
    get_notifications_for_tips: "دریافت اعلان برای نکات و پیام ها"،
    no_thanks: 'نه ممنون',
    open_settings: 'تنظیمات باز'،
    swipe_for_more: 'برای اطلاعات بیشتر به بالا بکشید'،
    transaction_confirmation_alert:
      «همیشه قبل از تأیید، دوبار بررسی کنید که برای چه کسی ارسال می کنید.  هرگز به آدرس برداشت صرافی ارسال نکنید.  تراکنش های دوج کوین را نمی توان معکوس کرد!'،
    clear_amount: "مقدار پاک"،
    set_amount: "تعیین مقدار"،
    save_qr: "ذخیره QR"،
    WALLET_ADDRESS: «آدرس کیف پول»،
    dogetag_link: 'پیوند DOGETAG'،
    no_access_camera: 'دسترسی به دوربین وجود ندارد'،
    enable_camera_access_ios: "فعال کردن دسترسی به دوربین برای MyDoge"،
    grant_camera_permission_android: 'لطفاً به MyDoge اجازه دوربین بدهید'،
    scan_qr_payment: "اسکن کد QR برای انجام پرداخت"،
    select_image: 'انتخاب تصویر'،
    find_friends_heading: "دوستان را در MyDoge بیابید"،
    find_friends_description:
      "اجازه دسترسی به مخاطبین و یافتن دوستان و مخاطبین در MyDoge را آسان کنید."،
    find_friends_button: "یافتن دوستان"،
    later_button: 'من بعداً این کار را انجام خواهم داد'،
    own_address_error: 'شما نمی توانید به آدرس خود ارسال کنید'،
    invalid_address_error: 'آدرس نامعتبر'،
    results_title: 'نتایج'،
    همه: "همه"،
    در انتظار: "در انتظار"،
    enter_pin: 'PIN را وارد کنید'،
    enter_pin_to_confirm: "پین کیف پول خود را برای تایید وارد کنید"،
    Welcome_back: 'به بازگشت خوش آمدید',
    enter_wallet_pin: 'PIN کیف پول خود را وارد کنید'،
    forgot_pin: "پین را فراموش کرده ام"،
    forgot_pin_title: "پین را فراموش کرده ام"،
    forgot_pin_body: 'آیا می خواهید از بیومتریک برای باز کردن قفل کیف پول خود استفاده کنید؟'،
    اشتراک گذاری: 'اشتراک گذاری'،
    address_copied_to_clipboard: 'آدرس در کلیپ بورد کپی شد'،
    follows_you: 'تو را دنبال می کند',
    official_mydoge_profile: 'نمایه رسمی MyDoge'،
    official_mydoge_commerce_profile: 'Official MyDoge Commerce Profile'،
    official_foundation_profile: "نمایه رسمی بنیاد"،
    follow_back: 'Follow Back',
    دنبال کنید: "دنبال کنید"،
    نکته: "نکته"،
    share_profile: 'اشتراک گذاری نمایه'،
    unfollow: 'Unfollow',
    رفع انسداد: "رفع انسداد"،
    block_or_report: 'Block or Report',
    copy_profile_url: 'کپی آدرس نمایه'،
    memes_error: 'خطا در بارگیری میمها.  لطفا برگردید و دوباره امتحان کنید.'،
    user_profile_hidden: 'نمایه کاربر پنهان است'،
    error_loading_profile:
      خطا در بارگیری نمایه.  لطفا برگردید و دوباره امتحان کنید.'،
    uid_not_specified: 'خطا: uid مشخص نشده است.  لطفا به پشتیبانی اطلاع دهید.',
    block_or_report_description:
      «MyDoge تمام نمایه‌های گزارش‌شده را برای هرگونه فعالیتی بر خلاف دستورالعمل‌های ما بررسی می‌ک

ند.  همچنین می‌توانید نمایه را مسدود کنید تا پست‌های آن‌ها مشاهده نشود.',
    nevermind: "بی حوصله"،
    گزارش: "گزارش"،
    بلوک: "بلاک"،
    unblock_user: 'لغو انسداد کاربر؟'،
    unblock_user_description:
      "این کار باعث رفع انسداد کاربر می شود و شما همچنان پست های او را مشاهده خواهید کرد."،
مسعود احمدی: you_have_no_posts_yet: 'شما هنوز هیچ پستی ندارید',
    no_posts_yet: 'هنوز هیچ پستی وجود ندارد'،
    مقدار: "مقدار"،
    سفارشی: "سفارشی"،
    add_a_message: "افزودن یک پیام"،
    find_friends: 'دوستان پیدا کن',
    لغو: "لغو"،
    i_understand_continue: "می فهمم، ادامه بده"،
    هی_مطمئن هستی: 'هی!  مطمئنی؟'،
    delete_backup_confirmation:
      وقتی این نسخه پشتیبان را حذف کردید، پشتیبان‌گیری ابری خود را از دست می‌دهید، این عمل قابل لغو نیست،
    all_transactions: 'همه تراکنشها'،
    pending_transactions: "تراکنش های معلق"،
  }،
};